#include <stdio.h>

int main() {
	//연산자
	//산수연산: +,-,*,/,%
	//대입연산:=,+=,-=,*=,/=,%=
	//증감연산:++,--
	//비교연산:>,>=,<,<=,==,!=
	//논리연산:&&,||,!
	//비트연산: <<,>>,&,|,^,~
	//기타연산:? :,&,*

	int n1 = 10;
	int n2 = 3;
	int n3;
	float f1;


	//산술 연산자


	n3 = n1 + n2;  // 연산순서 n1-> 10 n2-> 3  10 + 3 = (임시변수) = n3
	printf("%d + %d = %d\n", n1, n2, n3);

	n3 = n1 + n2;
	printf("%d + %d = %d\n", n1, n2, n3);
	n3 = n1 -  n2;
	printf("%d - %d = %d\n", n1, n2, n3);
	n3 = n1 * n2;
	printf("%d * %d = %d\n", n1, n2, n3);
	f1 = n1 / (float)n2;  // 실수와 정수의 연산은 실수
	printf("%d / %d = %f\n", n1, n2, f1);
	n3 = n1 % n2;
	printf("%d %% %d = %d\n", n1, n2, n3);

	//형변환(tyoecast) : 형변환시 데이터 손실 가능성존재
	
	char n;
	n1 = 300;
	n = n1; // 묵시적 형변환
	n = (char)n1; // 명시적 형변환
	f1 = 3.3333F;
	n1 = (int)f1; //소수점 소실 ,묵시적 형변환

	



	return 0;
}